/*
 * Copyright (c) 2025, Oracle and/or its affiliates. All rights reserved.
 * DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS FILE HEADER.
 *
 * This code is free software; you can redistribute it and/or modify it
 * under the terms of the GNU General Public License version 2 only, as
 * published by the Free Software Foundation.  Oracle designates this
 * particular file as subject to the "Classpath" exception as provided
 * by Oracle in the LICENSE file that accompanied this code.
 *
 * This code is distributed in the hope that it will be useful, but WITHOUT
 * ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or
 * FITNESS FOR A PARTICULAR PURPOSE.  See the GNU General Public License
 * version 2 for more details (a copy is included in the LICENSE file that
 * accompanied this code).
 *
 * You should have received a copy of the GNU General Public License version
 * 2 along with this work; if not, write to the Free Software Foundation,
 * Inc., 51 Franklin St, Fifth Floor, Boston, MA 02110-1301 USA.
 *
 * Please contact Oracle, 500 Oracle Parkway, Redwood Shores, CA 94065 USA
 * or visit www.oracle.com if you need additional information or have any
 * questions.
 */

// Generated by jextract

package org.openjdk.engine.python.bindings;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;

 *     int _config_init;
 *     int isolated;
 *     int use_environment;
 *     int dev_mode;
 *     int install_signal_handlers;
 *     int use_hash_seed;
 *     unsigned long hash_seed;
 *     int faulthandler;
 *     int tracemalloc;
 *     int perf_profiling;
 *     int remote_debug;
 *     int import_time;
 *     int code_debug_ranges;
 *     int show_ref_count;
 *     int dump_refs;
 *     wchar_t *dump_refs_file;
 *     int malloc_stats;
 *     wchar_t *filesystem_encoding;
 *     wchar_t *filesystem_errors;
 *     wchar_t *pycache_prefix;
 *     int parse_argv;
 *     PyWideStringList orig_argv;
 *     PyWideStringList argv;
 *     PyWideStringList xoptions;
 *     PyWideStringList warnoptions;
 *     int site_import;
 *     int bytes_warning;
 *     int warn_default_encoding;
 *     int inspect;
 *     int interactive;
 *     int optimization_level;
 *     int parser_debug;
 *     int write_bytecode;
 *     int verbose;
 *     int quiet;
 *     int user_site_directory;
 *     int configure_c_stdio;
 *     int buffered_stdio;
 *     wchar_t *stdio_encoding;
 *     wchar_t *stdio_errors;
 *     wchar_t *check_hash_pycs_mode;
 *     int use_frozen_modules;
 *     int safe_path;
 *     int int_max_str_digits;
 *     int thread_inherit_context;
 *     int context_aware_warnings;
 *     int cpu_count;
 *     int pathconfig_warnings;
 *     wchar_t *program_name;
 *     wchar_t *pythonpath_env;
 *     wchar_t *home;
 *     wchar_t *platlibdir;
 *     int module_search_paths_set;
 *     PyWideStringList module_search_paths;
 *     wchar_t *stdlib_dir;
 *     wchar_t *executable;
 *     wchar_t *base_executable;
 *     wchar_t *prefix;
 *     wchar_t *base_prefix;
 *     wchar_t *exec_prefix;
 *     wchar_t *base_exec_prefix;
 *     int skip_source_first_line;
 *     wchar_t *run_command;
 *     wchar_t *run_module;
 *     wchar_t *run_filename;
 *     wchar_t *sys_path_0;
 *     int _install_importlib;
 *     int _init_main;
 *     int _is_python_build;
 * }
 * }
 */
public class PyConfig {

    PyConfig() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        Python_h.C_INT.withName("_config_init"),
        Python_h.C_INT.withName("isolated"),
        Python_h.C_INT.withName("use_environment"),
        Python_h.C_INT.withName("dev_mode"),
        Python_h.C_INT.withName("install_signal_handlers"),
        Python_h.C_INT.withName("use_hash_seed"),
        Python_h.C_LONG.withName("hash_seed"),
        Python_h.C_INT.withName("faulthandler"),
        Python_h.C_INT.withName("tracemalloc"),
        Python_h.C_INT.withName("perf_profiling"),
        Python_h.C_INT.withName("remote_debug"),
        Python_h.C_INT.withName("import_time"),
        Python_h.C_INT.withName("code_debug_ranges"),
        Python_h.C_INT.withName("show_ref_count"),
        Python_h.C_INT.withName("dump_refs"),
        Python_h.C_POINTER.withName("dump_refs_file"),
        Python_h.C_INT.withName("malloc_stats"),
        MemoryLayout.paddingLayout(4),
        Python_h.C_POINTER.withName("filesystem_encoding"),
        Python_h.C_POINTER.withName("filesystem_errors"),
        Python_h.C_POINTER.withName("pycache_prefix"),
        Python_h.C_INT.withName("parse_argv"),
        MemoryLayout.paddingLayout(4),
        PyWideStringList.layout().withName("orig_argv"),
        PyWideStringList.layout().withName("argv"),
        PyWideStringList.layout().withName("xoptions"),
        PyWideStringList.layout().withName("warnoptions"),
        Python_h.C_INT.withName("site_import"),
        Python_h.C_INT.withName("bytes_warning"),
        Python_h.C_INT.withName("warn_default_encoding"),
        Python_h.C_INT.withName("inspect"),
        Python_h.C_INT.withName("interactive"),
        Python_h.C_INT.withName("optimization_level"),
        Python_h.C_INT.withName("parser_debug"),
        Python_h.C_INT.withName("write_bytecode"),
        Python_h.C_INT.withName("verbose"),
        Python_h.C_INT.withName("quiet"),
        Python_h.C_INT.withName("user_site_directory"),
        Python_h.C_INT.withName("configure_c_stdio"),
        Python_h.C_INT.withName("buffered_stdio"),
        MemoryLayout.paddingLayout(4),
        Python_h.C_POINTER.withName("stdio_encoding"),
        Python_h.C_POINTER.withName("stdio_errors"),
        Python_h.C_POINTER.withName("check_hash_pycs_mode"),
        Python_h.C_INT.withName("use_frozen_modules"),
        Python_h.C_INT.withName("safe_path"),
        Python_h.C_INT.withName("int_max_str_digits"),
        Python_h.C_INT.withName("thread_inherit_context"),
        Python_h.C_INT.withName("context_aware_warnings"),
        Python_h.C_INT.withName("cpu_count"),
        Python_h.C_INT.withName("pathconfig_warnings"),
        MemoryLayout.paddingLayout(4),
        Python_h.C_POINTER.withName("program_name"),
        Python_h.C_POINTER.withName("pythonpath_env"),
        Python_h.C_POINTER.withName("home"),
        Python_h.C_POINTER.withName("platlibdir"),
        Python_h.C_INT.withName("module_search_paths_set"),
        MemoryLayout.paddingLayout(4),
        PyWideStringList.layout().withName("module_search_paths"),
        Python_h.C_POINTER.withName("stdlib_dir"),
        Python_h.C_POINTER.withName("executable"),
        Python_h.C_POINTER.withName("base_executable"),
        Python_h.C_POINTER.withName("prefix"),
        Python_h.C_POINTER.withName("base_prefix"),
        Python_h.C_POINTER.withName("exec_prefix"),
        Python_h.C_POINTER.withName("base_exec_prefix"),
        Python_h.C_INT.withName("skip_source_first_line"),
        MemoryLayout.paddingLayout(4),
        Python_h.C_POINTER.withName("run_command"),
        Python_h.C_POINTER.withName("run_module"),
        Python_h.C_POINTER.withName("run_filename"),
        Python_h.C_POINTER.withName("sys_path_0"),
        Python_h.C_INT.withName("_install_importlib"),
        Python_h.C_INT.withName("_init_main"),
        Python_h.C_INT.withName("_is_python_build"),
        MemoryLayout.paddingLayout(4)
    ).withName("PyConfig");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final OfInt _config_init$LAYOUT = (OfInt)$LAYOUT.select(groupElement("_config_init"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * int _config_init
     * }
     */
    public static final OfInt _config_init$layout() {
        return _config_init$LAYOUT;
    }

    private static final long _config_init$OFFSET = $LAYOUT.byteOffset(groupElement("_config_init"));

    /**
     * Offset for field:
     * {@snippet lang=c :
     * int _config_init
     * }
     */
    public static final long _config_init$offset() {
        return _config_init$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * int _config_init
     * }
     */
    public static int _config_init(MemorySegment struct) {
